Revit 2027 API
Form.IsProfileEdge Method
Tell if an edge or curve is generated from a profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsProfileEdge(
	Reference curveOrEdgeReference
)
Public Function IsProfileEdge (
	curveOrEdgeReference As Reference
) As Boolean
public:
bool IsProfileEdge(
	Reference^ curveOrEdgeReference
)
member IsProfileEdge :
        curveOrEdgeReference : Reference -> bool
Parameters
curveOrEdgeReference Reference
The reference of the edge or curve to be checked.
Return Value
Boolean
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace